* fbcli.el
#+begin_src emacs-lisp
(require 'cl)
(require 'thingatpt)
(require 'parse-time)

;; To configure
;; M-x customize-group RET cpanel

(defgroup cpanel nil
  "cPanel customization group")

(defcustom fbcli-binary "fbcli"
  "Location of the fbcli binary"
  :type 'file
  :group 'cpanel)

(defcustom fbcli-password-file nil
  "Location of the password file"
  :type 'file
  :group 'cpanel)

(defcustom fbcli-user nil
  "Fogbugz username"
  :type 'string
  :group 'cpanel)

(defcustom fbcli-url "fogbugz.cpanel.net"
  "Fogbugz server"
  :type 'string
  :group 'cpanel)

(defun fbcli-get-case-number ()
  (let ((fbcase (or (thing-at-point 'word)
                    (read-string "Case Number> "))))
    (when (eql (string-match "^[[:digit:]]+$" fbcase) 0)
      (parse-integer fbcase))))

(defun fbcli-view-case ()
  (interactive)
  (let ((fbcli-buffer "*fbcli*")
        (fbcase (fbcli-get-case-number)))
    (if (integerp fbcase)
        (progn
          (set-buffer (get-buffer-create fbcli-buffer))
          (erase-buffer)
          (shell-command
           (format "%s --password-file %s --url %s --user %s --extended view %s" fbcli-binary fbcli-password-file fbcli-url fbcli-user fbcase)
           (current-buffer) nil)
          (let ((url (format "http://%s/default.asp?%s" fbcli-url fbcase)))
            (message "%s" url)
            (kill-new (format "%s" url))))
      (message "Case number not given"))))

(global-set-key (kbd "C-c f") 'fbcli-view-case)

(provide 'fbcli)
#+end_src

 #+begin_src sh :var filename=(buffer-file-name) :exports both
   wc -w $filename
 #+end_src

 #+results:
 : 1479 /Users/robert/Dropbox/WIKI/Elisp.org

